# Pandas

In [160]:
import numpy as np
import pandas as pd

#### Series

In [161]:
myDictionary = {"Ozge" : 24, "Zeynep" : 40, "Atil" : 50, "Mehmet" : 30}

In [162]:
type(pd.Series(myDictionary))

pandas.core.series.Series

In [163]:
pd.Series(myDictionary)

Ozge      24
Zeynep    40
Atil      50
Mehmet    30
dtype: int64

In [164]:
myAges = [24,40,30]
myNames = ["Ozge", "Zeynep", "Mehmet"]

In [165]:
pd.Series(myAges)

0    24
1    40
2    30
dtype: int64

In [166]:
pd.Series(myNames)

0      Ozge
1    Zeynep
2    Mehmet
dtype: object

In [167]:
pd.Series(myAges,myNames)

Ozge      24
Zeynep    40
Mehmet    30
dtype: int64

In [168]:
numpyArray = np.array([24,40,30])

In [169]:
numpyArray

array([24, 40, 30])

In [170]:
pd.Series(numpyArray)

0    24
1    40
2    30
dtype: int64

In [171]:
pd.Series(numpyArray,myNames)

Ozge      24
Zeynep    40
Mehmet    30
dtype: int64

In [172]:
pd.Series(["Atil","Atlas","Osman"],[1,2,3])

1     Atil
2    Atlas
3    Osman
dtype: object

In [173]:
yarismaSonucu1 = pd.Series([10,5,1],["Atil","Atlas","Osman"])

In [174]:
yarismaSonucu1

Atil     10
Atlas     5
Osman     1
dtype: int64

In [175]:
yarismaSonucu2 = pd.Series([20,10,18],["Atil","Atlas","Osman"])

In [176]:
yarismaSonucu2

Atil     20
Atlas    10
Osman    18
dtype: int64

In [177]:
yarismaSonucu2["Atlas"]

np.int64(10)

In [178]:
yarismaSonucu1["Atlas"]

np.int64(5)

In [179]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [180]:
sonSonuc

Atil     30
Atlas    15
Osman    19
dtype: int64

In [181]:
farkliSeries1 = pd.Series([33,14,28,22],["a","b","c","d"])

In [182]:
farkliSeries2 = pd.Series([10,4,8,13],["a","c","f","g"])

In [183]:
farkliSeries1

a    33
b    14
c    28
d    22
dtype: int64

In [184]:
farkliSeries2

a    10
c     4
f     8
g    13
dtype: int64

In [185]:
farkliSeriesSonuc = farkliSeries1 + farkliSeries2

In [186]:
farkliSeriesSonuc

a    43.0
b     NaN
c    32.0
d     NaN
f     NaN
g     NaN
dtype: float64

# Data Frame

In [187]:
data = np.random.randn(4,3)

In [188]:
data

array([[ 1.03167608, -0.89087382,  0.04481196],
       [ 0.18585335,  0.9021894 , -1.95671116],
       [ 0.47295697,  1.29885852,  0.03213799],
       [-1.09507936, -1.46918793,  1.04724372]])

In [189]:
dataFrame = pd.DataFrame(data)

In [190]:
dataFrame

          0         1         2
0  1.031676 -0.890874  0.044812
1  0.185853  0.902189 -1.956711
2  0.472957  1.298859  0.032138
3 -1.095079 -1.469188  1.047244

In [191]:
dataFrame[0]

0    1.031676
1    0.185853
2    0.472957
3   -1.095079
Name: 0, dtype: float64

In [192]:
type(dataFrame[0])

pandas.core.series.Series

In [193]:
newDataFrame = pd.DataFrame(data,index=["Ozge","Zeynep","Atil","Atlas"],columns = ["Maas","Yas","Saat"])

In [194]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [195]:
newDataFrame["Yas"]

Ozge     -0.890874
Zeynep    0.902189
Atil      1.298859
Atlas    -1.469188
Name: Yas, dtype: float64

In [196]:
newDataFrame["Saat"]

Ozge      0.044812
Zeynep   -1.956711
Atil      0.032138
Atlas     1.047244
Name: Saat, dtype: float64

In [197]:
newDataFrame["Maas"]

Ozge      1.031676
Zeynep    0.185853
Atil      0.472957
Atlas    -1.095079
Name: Maas, dtype: float64

In [198]:
newDataFrame[["Maas","Yas"]]

            Maas       Yas
Ozge    1.031676 -0.890874
Zeynep  0.185853  0.902189
Atil    0.472957  1.298859
Atlas  -1.095079 -1.469188

In [199]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [200]:
newDataFrame.loc["Atil"]

Maas    0.472957
Yas     1.298859
Saat    0.032138
Name: Atil, dtype: float64

In [201]:
newDataFrame.loc["Ozge"]

Maas    1.031676
Yas    -0.890874
Saat    0.044812
Name: Ozge, dtype: float64

In [202]:
newDataFrame.iloc[1]

Maas    0.185853
Yas     0.902189
Saat   -1.956711
Name: Zeynep, dtype: float64

In [203]:
newDataFrame.iloc[0]

Maas    1.031676
Yas    -0.890874
Saat    0.044812
Name: Ozge, dtype: float64

In [204]:
newDataFrame["EYT"] = newDataFrame["Yas"] + newDataFrame["Yas"]

In [205]:
newDataFrame

            Maas       Yas      Saat       EYT
Ozge    1.031676 -0.890874  0.044812 -1.781748
Zeynep  0.185853  0.902189 -1.956711  1.804379
Atil    0.472957  1.298859  0.032138  2.597717
Atlas  -1.095079 -1.469188  1.047244 -2.938376

In [206]:
newDataFrame.drop("EYT",axis = 1)

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [207]:
newDataFrame.drop("Zeynep", axis = 0)

           Maas       Yas      Saat       EYT
Ozge   1.031676 -0.890874  0.044812 -1.781748
Atil   0.472957  1.298859  0.032138  2.597717
Atlas -1.095079 -1.469188  1.047244 -2.938376

In [208]:
newDataFrame.drop("EYT",axis = 1, inplace = True)
## inplace ile temelli silinir

In [209]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [210]:
newDataFrame.loc["Ozge"]["Yas"]

np.float64(-0.8908738154145872)

In [211]:
newDataFrame.loc["Ozge"]["Maas"]

np.float64(1.0316760844974313)

In [212]:
newDataFrame.loc["Ozge","Maas"]

np.float64(1.0316760844974313)

In [213]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [214]:
booleanFrame = newDataFrame < 0

In [215]:
booleanFrame

         Maas    Yas   Saat
Ozge    False   True  False
Zeynep  False  False   True
Atil    False  False  False
Atlas    True   True  False

In [216]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [217]:
newDataFrame[booleanFrame]

            Maas       Yas      Saat
Ozge         NaN -0.890874       NaN
Zeynep       NaN       NaN -1.956711
Atil         NaN       NaN       NaN
Atlas  -1.095079 -1.469188       NaN

In [218]:
newDataFrame[newDataFrame < 0]

            Maas       Yas      Saat
Ozge         NaN -0.890874       NaN
Zeynep       NaN       NaN -1.956711
Atil         NaN       NaN       NaN
Atlas  -1.095079 -1.469188       NaN

In [219]:
newDataFrame["Yas" ] > 1

Ozge      False
Zeynep    False
Atil       True
Atlas     False
Name: Yas, dtype: bool

In [220]:
newDataFrame[newDataFrame["Yas" ] > 1]

          Maas       Yas      Saat
Atil  0.472957  1.298859  0.032138

In [221]:
newDataFrame[newDataFrame["Saat" ] > 0]

           Maas       Yas      Saat
Ozge   1.031676 -0.890874  0.044812
Atil   0.472957  1.298859  0.032138
Atlas -1.095079 -1.469188  1.047244

In [222]:
newDataFrame.reset_index()

    index      Maas       Yas      Saat
0    Ozge  1.031676 -0.890874  0.044812
1  Zeynep  0.185853  0.902189 -1.956711
2    Atil  0.472957  1.298859  0.032138
3   Atlas -1.095079 -1.469188  1.047244

In [223]:
newDataFrame

            Maas       Yas      Saat
Ozge    1.031676 -0.890874  0.044812
Zeynep  0.185853  0.902189 -1.956711
Atil    0.472957  1.298859  0.032138
Atlas  -1.095079 -1.469188  1.047244

In [225]:
newIndexList = ["Ozg","Zey","Ati","Atl"]

In [226]:
newDataFrame["Yeni Index"] = newIndexList

In [227]:
newDataFrame

            Maas       Yas      Saat Yeni Index
Ozge    1.031676 -0.890874  0.044812        Ozg
Zeynep  0.185853  0.902189 -1.956711        Zey
Atil    0.472957  1.298859  0.032138        Ati
Atlas  -1.095079 -1.469188  1.047244        Atl

In [229]:
newDataFrame.set_index("Yeni Index")

                Maas       Yas      Saat
Yeni Index
Ozg         1.031676 -0.890874  0.044812
Zey         0.185853  0.902189 -1.956711
Ati         0.472957  1.298859  0.032138
Atl        -1.095079 -1.469188  1.047244

In [230]:
newDataFrame

            Maas       Yas      Saat Yeni Index
Ozge    1.031676 -0.890874  0.044812        Ozg
Zeynep  0.185853  0.902189 -1.956711        Zey
Atil    0.472957  1.298859  0.032138        Ati
Atlas  -1.095079 -1.469188  1.047244        Atl

In [231]:
newDataFrame.set_index("Yeni Index", inplace = True)

In [232]:
newDataFrame

                Maas       Yas      Saat
Yeni Index
Ozg         1.031676 -0.890874  0.044812
Zey         0.185853  0.902189 -1.956711
Ati         0.472957  1.298859  0.032138
Atl        -1.095079 -1.469188  1.047244

In [235]:
newDataFrame.loc["Ati"]

Maas    0.472957
Yas     1.298859
Saat    0.032138
Name: Ati, dtype: float64

In [236]:
ilkIndeksler = ["Simpson","Simpson","Simpson", "South Park", "South Park", "South Park", "South Park"]

In [237]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [238]:
birlesmisIndeksler = list(zip(ilkIndeksler,icIndeksler))

In [239]:
birlesmisIndeksler

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [240]:
birlesmisIndeksler = pd.MultiIndex.from_tuples(birlesmisIndeksler)

In [241]:
birlesmisIndeksler

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [242]:
type(birlesmisIndeksler)

pandas.core.indexes.multi.MultiIndex

In [244]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[33,"C"],[22,"D"],[18,"E"],[24,"F"]]

In [245]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [246]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeksler,columns=["Yas","Meslek"])

In [247]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    33      C
South Park Cartman  22      D
           Kenny    18      E
           Kyle     24      F

In [248]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  33      C

In [249]:
cizgiFilmDataFrame.loc["South Park"]

        Yas Meslek
Cartman  22      D
Kenny    18      E
Kyle     24      F

In [250]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       18
Meslek     E
Name: Kenny, dtype: object

In [252]:
cizgiFilmDataFrame.index.names = ["Film Adi","Isim"]

In [253]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adi   Isim
Simpson    Homer    40      A
           Bart     10      B
           Marge    33      C
South Park Cartman  22      D
           Kenny    18      E
           Kyle     24      F